In [1]:
import pandas as pd

In [29]:
import numpy as np

In [32]:
import random

In [2]:
data = pd.read_csv('tags.csv')

In [3]:
data.shape

(465564, 4)

In [4]:
data.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [7]:
data = data.drop(columns = ['timestamp'])

In [8]:
data.head()

   userId  movieId            tag
0      18     4141    Mark Waters
1      65      208      dark hero
2      65      353      dark hero
3      65      521  noir thriller
4      65      592      dark hero

In [9]:
tags_set = data['tag'].unique()

In [13]:
tags_set.shape

(38644,)

In [14]:
data.userId.unique().shape

(7801,)

In [16]:
data.movieId.unique().shape

(19545,)

In [28]:
pos_dict = dict()
for uid, mid, tag in data.values:
    if (uid, mid) not in pos_dict:
        pos_dict[(uid, mid)] = set()
    pos_dict[(uid, mid)].add(tag)

In [33]:
neg_dict = {}
for uid, mid in pos_dict:
    k = random.randint(0,5)
    pos_num = len(pos_dict[(uid,mid)])
    neg_num = pos_num * k
    pos_tags = np.random.choice(tags_set, neg_num)
    neg_dict[(uid,mid)] = set(set(pos_tags) - pos_dict[(uid, mid)])

In [34]:
neg_dict[(18,4141)]

{'Johnnie To'}

In [35]:
neg_df_dict = {'userId':[], 'movieId': [], 'tag':[]}
for uid, mid in neg_dict:
    for tag in neg_dict[(uid,mid)]:
        neg_df_dict['userId'].append(uid)
        neg_df_dict['movieId'].append(mid)
        neg_df_dict['tag'].append(tag)

In [36]:
neg_df = pd.DataFrame(neg_df_dict)

In [37]:
neg_df.head()

   userId  movieId                    tag
0      18     4141             Johnnie To
1      65      208       Ho Chi Minh City
2      65      208  Ecclecticly watchable
3      65      208         angelina Jolie
4      65      353               no nazis

In [38]:
data['label'] = 1
neg_df['label'] = 0

In [39]:
data.head()

   userId  movieId            tag  label
0      18     4141    Mark Waters      1
1      65      208      dark hero      1
2      65      353      dark hero      1
3      65      521  noir thriller      1
4      65      592      dark hero      1

In [40]:
all_data = data.append(neg_df).reset_index(drop=True)

In [41]:
all_data.head()

   index  userId  movieId            tag  label
0      0      18     4141    Mark Waters      1
1      1      65      208      dark hero      1
2      2      65      353      dark hero      1
3      3      65      521  noir thriller      1
4      4      65      592      dark hero      1

In [44]:
all_data = all_data.sample(frac=1).reset_index(drop=True)

In [49]:
all_data = all_data.sample(frac=1).reset_index(drop=True)

In [50]:
all_data.head()

    index  userId  movieId               tag  label
0  105570   26445    91658           mystery      1
1  280642   84716     3565       Ashley Judd      1
2  538035   65256    91077         Ringo Lam      0
3  464257  138280    93498  campaign manager      1
4  670212   78564    77307  saw it ten times      0